app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def current_user
        token = get_token
        if token
          decoded_token = decode_token(token)
          user = User.find(decoded_token["user_id"])