app/controllers/weights_controller.rb

INSERT INTO "weights" ("user_id", "weight_kg", "weight_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["weight_kg", 100.0], ["weight_date", "2019-07-17 15:55:00"], ["created_at", "2019-07-17 15:55:44.018972"], ["updated_at", "2019-07-17 15:55:44.018972"]]
---
    def create
    # As we want to manipulate weight_date ... using the permitted params method
    # seems to cause issues - ideally I would like to set the date, and use weight_params
        user=current_user;
        if user
            weight_kg=params[:detail][:weight_kg]
        # Dodgy method of sorting out the date
            weight_date_d=params[:detail][:weight_date_d];
            weight_date_t=params[:detail][:weight_date_t];
            if weight_date_d==nil || weight_date_d==""
                weight_date_d=Date.current.to_s
            end
            if weight_date_t==nil || weight_date_t==""
                weight_date_t=Time.current.strftime("%H:%M")
            end
            weight_date = (weight_date_d + ' ' + weight_date_t).to_datetime

            weight = Weight.create( user_id:user.id,
                        weight_kg:weight_kg,
                        weight_date:weight_date)